IDEA Open Model
OpenModel.LoadFromString Method
Compatible with IDEA StatiCa v 10.1
 Creates the instance of Open Model from xml string
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public static OpenModel LoadFromString(
	string xmlString
)
Public Shared Function LoadFromString (
	xmlString As String
) As OpenModel
public:
static OpenModel^ LoadFromString(
	String^ xmlString
)
Parameters
xmlString
Type: System.String
The input string
Return Value
Type: OpenModel
The new instance of Open Model
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace